main.org
#+HUGO_BASE_DIR: .
#+options: creator:nil author:nil

* Homepage
:PROPERTIES:
:EXPORT_FILE_NAME: _index
:EXPORT_HUGO_SECTION: /
:END:

* CV
:PROPERTIES:
:EXPORT_HUGO_SECTION: /
:EXPORT_HUGO_BUNDLE: cv
:EXPORT_FILE_NAME: index
:CUSTOM_ID: cv
:END:

** Education
- 2010 - 2014: B.S., Peking University, School of Mathematical Sciences
- 2014 - 2019: Ph.D., New York University, Courant Institute (advisor: [[https://cims.nyu.edu/~bakhtin/][Yuri Bakhtin]])
** Work
- 2023.7 - now: Associate Professor, Southern University of Science and Technology
- 2022 - 2023: Postdoc, University of Michigan, Ann Arbor
- 2019 - 2022: Postdoc, University of Toronto, Mississauga
** Teaching
- 2023 Fall: MAT215, Probability, SUSTech
- 2022 Fall & 2023 Spring: MAT115, Calculus I, UM
- 2021 Fall & 2022 Spring: MAT337, Introduction to Real Analysis, U of T
- 2020 Fall & 2021 Spring: MAT244, Ordinary Differential Equations, U of T
- 2019 Fall & 2020 Spring: MAT137, Calculus for Commerce, U of T 
- 2018 Fall: Putnam Competition Workshop, NYU
- 2018 Spring: TA, Introduction to Mathematical Analysis II, NYU
- 2017 Spring: TA, Probability and Statistics, NYU


